[
    {
        "id": 1,
        "title": "Beber",
        "cover": "beber.png",
        "description": {
            "eng" : "Full-stack application for event organization",
            "fr": "Application fullstack d'oranisation d'évènements"
        },
        "technos": [
            "HTML/CSS",
            "JAVASCRIPT",
            "REACT",
            "NODEJS",
            "EXPRESS",
            "MYSQL"
        ],
        "tools": [
            "GIT",
            "SASS",
            "SILICIUM",
            "FIGMA",
            "DOCKER",
            "REDUX"
        ],
        "summary": {
            "eng" : "Béber is a mobile-first application designed to assist in event organization. It allows multiple users to create and join events, suggest accommodations using links from platforms like Airbnb, and vote on the stay location. The frontend is built with React, the backend with Node.js, and the database with MySQL. Docker was used for deploying the first test version.",
            "fr": "Béber est une application mobilefirst accompagnatrice d'organisation d'évènements. Elle permet à plusieurs personnes de créer et de rejoindre un évènement, de proposer des logements à partir de liens d'annonces type airbnb, et de voter pour le lieu de séjour. Le front est en React, le back en NodeJS, la base de données en MYSQL. Docker a été utilisé pour le déploiement de la première version de test."
        },
        "projectLink" : "https://github.com/TheGoozmeister/b-ber"
    },
    {
        "id": 2,
        "title": "ArgentBank",
        "cover": "argentBank.png",
        "description": 
            {
                "eng" : "Banking Application",
                "fr" : "Application bancaire"
            },   
        "technos": [
            "HTML/CSS",
            "JAVASCRIPT",
            "REACT"
        ],
        "tools" : [
            "GIT",
            "SASS",
            "REDUX"
        ],
        "summary": {
            "eng": "Project built from HTML/CSS wireframes. Redux was implemented to allow users to log in to the application and modify their personal information.",
            "fr": "Projet réalisé à partir de warframes HTML/CSS. Redux a été implanté afin de permettre à l'utilisateur de se connecter à l'application et de modifier ses informations personnelles. "
        },
        "projectLink" : "https://github.com/TheGoozmeister/p13"
    },{
        "id": 3,
        "title": "Billed",
        "cover": "billed.png",
        "description": {
            "eng" : "Testing of a human resources application",
            "fr": "Test d'une application de ressources humaines"
        },
        "technos": [
            "HTML/CSS",
            "REACT"
        ],
        "tools" : [
            "GIT",
            "JEST"
        ],
        "summary": {
            "eng" : "Human resources application to debug and test. Unit tests and End-to-End tests have been implemented using Jest.",
            "fr": "Application de ressources humaines à débugguer et à tester. La mise en place de test unitaires et de tests End to End on été mis en place, en utilisant Jest."
        },
        "projectLink" : "https://github.com/TheGoozmeister/p9"
    },{
        "id": 4,
        "title": "Kasa",
        "cover": "kasa.png",
        "description": {
            "eng" : "React application for housing listings",
            "fr": "Application React de proposition de logements"
        },
        "technos": [
            "HTML/CSS",
            "JAVASCRIPT",
            "REACT"
        ],
        "tools" : [
            "GIT",
            "SASS"
        ],
        "summary": {
            "eng" : "First React project completed. The application is a website similar to Airbnb, where multiple accommodations are offered based on provided data. A carousel component was notably developed in this project.",
            "fr": "Premier projet réalisé en React. L'application est un site type airbnb, où plusieurs logements sont proposés à partir de datas fournies. Un composant carrousel a notamment été développé dans ce projet. "
        },
        "projectLink" : "https://github.com/TheGoozmeister/Kasa"
    },{
        "id": 5,
        "title": "Les Petits Plats",
        "cover": "petitsPlats.png",
        "description": {
            "eng" : "Cooking recipe search application",
            "fr": "Application de recherche de recettes de cuisine"
        },
        "technos": [
            "HTML/CSS",
            "JAVASCRIPT"
        ],
        "tools": [
            "GIT",
            "SASS"
        ],
        "summary": {
            "eng" : "Project implemented in vanilla JavaScript. The objective here was to create a search algorithm in multiple ways and compare their performances.",
            "fr": "Projet réalisé en Javascript vanilla. L'objectif ici était de réalisé un algorithme de recherche de plusieurs manières et d'en comparer les performances."
        },
        "projectLink" : "https://github.com/TheGoozmeister/p7"
    },{
        "id": 6,
        "title": "Portfolio V1",
        "cover": "portfoliov1.png",
        "description": {
            "eng" : "First version of my portfolio",
            "fr": "Premiere version de mon portfolio"
        },
        "technos": [
            "HTML/CSS"
        ],
        "tools": [
            "GIT",
            "BOOTSTRAP"
        ],
        "summary": {
            "eng" : "First version of my portfolio. The project utilizes the Bootstrap library for all the site's CSS.",
            "fr": "Première version de mon portfolio. Le projet utilise la bibliothèque bootstrap pour l'ensemble du css du site. "
        },
        "projectLink" : "https://github.com/TheGoozmeister/portfolio"
    },
    {
        "id": 7,
        "title": "Portfolio",
        "cover": "portfolio.png",
        "description": 
            {
                "eng" : "New version of Portfolio",
                "fr" : "Nouvelle version de Portfolio"
            },       
        "technos": [
            "HTML/CSS",
            "TYPESCRIPT",
            "REACT"
        ],
        "tools" : [
            "GIT",
            "DOCKER",
            "SASS",
            "REDUX"
        ],
        "summary":
            {
                "eng" : "Portfolio project built as a Single Page Application (SPA) using React and Typescript. UI/UX design work was done with Figma. Language selection is managed with Redux. Sass preprocessor was used for all CSS styling.",
                "fr" : "Projet de portfolio en SPA réalisé en React et Typescript. Le travail d'UI/UX a été réalisé à l'aide de figma. Le choix de la langue est géré avec Redux. Le préprocesseur Sass a été utilisé pour l'ensemble du CSS."
            },
        "projectLink" : "https://github.com/TheGoozmeister/portfoliov2"
    },
    {
        "id": 8,
        "title": "OhMyFood",
        "cover": "ohmyfood.png",
        "description": {
            "eng" : "Menu application with CSS animations",
            "fr": "Application de menus avec animations CSS"
        },
        "technos": [
            "HTML/CSS",
            "SASS"
        ],
        "tools" : [
            "GIT",
            "SASS"
        ],
        "summary": {
            "eng" : "Website in HTML/CSS featuring multiple animations. It's the first project utilizing Sass, which I subsequently used in the vast majority of projects.",
            "fr": "Site en HTML/CSS avec plusieurs animations. C'est le premier projet utilisant Sass, que j'ai par la suite utilisé dans la grande majorité des projets."
        },
        "projectLink" : "https://github.com/TheGoozmeister/Ohmyfood"
    },{
        "id": 9,
        "title": "GameOn",
        "cover": "gameon.png",
        "description": {
            "eng" : "Website for video game tournaments",
            "fr": "Site de tournois de jeux vidéos"
        },
        "technos": [
            "HTML/CSS",
            "SASS",
            "JAVASCRIPT"
        ],
        "tools" : [
            "GIT"
        ],
        "summary": {
            "eng" : "Project developed in vanilla JavaScript. The main challenge was to create a dynamic form.",
            "fr": "Projet réalisé en javascript vanilla. L'enjeu principal était de développer un formulaire dynamique."
        },
        "projectLink" : "https://github.com/TheGoozmeister/p4"
    },{
        "id": 10,
        "title": "FishEye",
        "cover": "fisheye.png",
        "description": {
            "eng" : "Photographer's advertisement website optimized for accessibility",
            "fr": "Site d'annonces de photographes optimisé pour l'accessibilité"
        },
        "technos": [
            "HTML/CSS",
            "SASS",
            "JAVASCRIPT"
        ],
        "tools" : [
            "GIT",
            "SASS",
            "ACCESSIBILITY"
        ],
        "summary": {
            "eng" : "The challenge of this project was to create a fully accessible website, allowing keyboard navigation and compatible with the devices of visually impaired individuals. It was implemented using vanilla JavaScript.",
            "fr": "L'enjeu de ce projet était d'avoir un site entièrement accessible, permettant la navigation au clavier et compatible avec les dispositifs des personnes mal voyantes. Il a été réalisé en Javascript vanilla."
        },
        "projectLink" : "https://github.com/TheGoozmeister/p6"
    },{
        "id": 11,
        "title": "Learn@Home",
        "cover": "learnathome.png",
        "description": {
            "eng" : "Designing a tutoring application",
            "fr": "Conception d'une application pour le soutien scolaire"
        },
        "technos": [
            
        ],
        "tools" : [
            "FIGMA",
            "KANBAN"
        ],
        "summary": {
            "eng" : "Based on a specification document, the challenge of this project was to establish user stories, design the website mockups using Figma, create use case diagrams, and set up a Kanban board to break down the project in a macro-level manner.",
            "fr": "A partir d'un cahier des charges, l'enjeu de ce projet était d'établir les user stories, les maquettes du site à l'aide de Figma, des diagrammes de cas d'usage et un Kanban découpant le projet de manière macro."
        },
        "projectLink" : "#"
    },{
        "id": 12,
        "title": "SportSee",
        "cover": "sportsee.png",
        "description": {
            "eng" : "Designing a tutoring application",
            "fr": "Conception d'une application pour le soutien scolaire"
        },
        "technos": [
            "HTML/CSS",
            "SASS",
            "JAVASCRIPT",
            "REACT"
        ],
        "tools" : [
            "GIT",
            "SASS",
            "RECHARTS"
        ],
        "summary": {
            "eng" : "A React application utilizing API calls and the Recharts library for creating charts.",
            "fr": "Application React utilisant des appels API et la librairie Recharts pour la réalisation des graphiques."
        },
        "projectLink" : "https://github.com/TheGoozmeister/p12"
    },{
        "id": 13,
        "title": "La Panthere",
        "cover": "lapanthere.png",
        "description": {
            "eng" : "Optimization of a web design agency",
            "fr": "Optimisation d'une agence de web design"
        },
        "technos": [
            "HTML/CSS",
            "BOOTSTRAP"
        ],
        "tools" : [
            "SEO",
            "ACCESSIBILITY"
        ],
        "summary": {
            "eng" : "Project to optimize an existing website. The goal was to make it accessible and to improve its SEO performance by implementing key performance indicators (KPIs).",
            "fr": "Projet d'optimisation d'un site web existant. L'objectif était de le rendre accessible et de fournir un travail au niveau du SEO, en mettant en place des KPI."
        },
        "projectLink" : "https://github.com/TheGoozmeister/Panthere-"
    },{
        "id": 14,
        "title": "Kanap",
        "cover": "kanap.png",
        "description": {
            "eng" : "Sofa sales website",
            "fr": "Site de vente de canapés"
        },
        "technos": [
            "HTML/CSS",
            "JAVASCRIPT"
        ],
        "tools" : [
            "GIT"
        ],
        "summary": {
            "eng" : "Sofa sales website built using vanilla JavaScript. This project served as my introduction to the language, where I implemented my first dynamic forms, API calls, and regular expressions.",
            "fr": "Site de vente de canapés réalisé en Javascript vanilla. C'est le projet par lequel j'ai appris ce langage., en mettant en place mes premiers formulaires dynamiques, appels API et regex."
        },
        "projectLink" : "https://github.com/TheGoozmeister/kanap"
    },{
        "id": 15,
        "title": "Booki",
        "cover": "booki.png",
        "description": {
            "eng" : "Optimizing a web design agency",
            "fr": "Maquette d'une application d'hébergements"
        },
        "technos": [
            "HTML/CSS",
            "BOOTSTRAP"
        ],
        "tools" : [
    
        ],
        "summary": {
            "eng" : "Showcase website for housing listings. This was the first project I completed using HTML/CSS.",
            "fr": "Site vitrine de propositions de logements. C'est le premier projet en HTML/CSS que j'ai réalisé."
        },
        "projectLink" : "https://github.com/TheGoozmeister/p2"
    },{
        "id": 16,
        "title": "Piiquante",
        "cover": "piiquante.png",
        "description": {
            "eng" : "Sauce sharing API",
            "fr": "API de partage de sauces"
        },
        "technos": [
            "NODEJS",
            "EXPRESS"
        ],
        "tools" : [
            "GIT",
            "MONGODB"
        ],
        "summary": {
            "eng" : "Development of a secure API with password hashing and token usage. The entire system was developed using NodeJS and Express, utilizing MongoDB as the database.",
            "fr": "Développement d'une API sécurisé avec hachage des mots de passe et utilisations de tokens. L'ensemble a été développé avec NodeJS et Express, en utilisant MONGODB comme database."
        },
        "projectLink" : "https://github.com/TheGoozmeister/HotTakes"
    }
]